src/Catalogs/ЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ЕдиницыИзмерения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
				<xr:Item>Catalog.НаборыЕдиницИзмерения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияПоКлассификатору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияВладельца</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЕдиницыИзмерения/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаПолученияДанныхВыбора.
//
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Рекурсия")
		И Параметры.Отбор.Свойство("Владелец") И ТипЗнч(Параметры.Отбор.Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		// При первом входе, если задана связь параметров выбора по значению номенклатуры,
		// то дополним параметры выбора отбором по владельцу - номенклатурным группам по иерархии.
		
		СтандартнаяОбработка = Ложь;
		
		Номенклатура = Параметры.Отбор.Владелец;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.КатегорияНоменклатуры КАК КатегорияНоменклатуры,
		|	Номенклатура.НаборЕдиницИзмерения КАК НаборЕдиницИзмерения,
		|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	Номенклатура.ИспользоватьНаборыЕдиницИзмерения КАК ИспользоватьНаборыЕдиницИзмерения,
		|	ПРЕДСТАВЛЕНИЕ(Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Номенклатура";
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Не Результат.Количество() Тогда
			Возврат
		КонецЕсли;
		
		Пока Результат.Следующий() Цикл
			КатегорияНоменклатуры = Результат.КатегорияНоменклатуры;
			ЕдиницаИзмеренияВладельца = Результат.ЕдиницаИзмерения;
			ЕдиницаИзмеренияВладельцаПредставление = Результат.ЕдиницаИзмеренияПредставление;
			НаборЕдиницИзмерения = Результат.НаборЕдиницИзмерения;
			ИспользоватьНаборыЕдиницИзмерения = Результат.ИспользоватьНаборыЕдиницИзмерения;
		КонецЦикла;
		
		МассивОтбора = Новый Массив;
		
		Если ИспользоватьНаборыЕдиницИзмерения И ЗначениеЗаполнено(НаборЕдиницИзмерения) Тогда
			МассивОтбора.Добавить(НаборЕдиницИзмерения);
		Иначе
			МассивОтбора.Добавить(Номенклатура);
		КонецЕсли;
		
		МассивОтбора.Добавить(КатегорияНоменклатуры);
		
		Родитель = КатегорияНоменклатуры.Родитель;
		Пока ЗначениеЗаполнено(Родитель) Цикл
			МассивОтбора.Добавить(Родитель);
			Родитель = Родитель.Родитель;
		КонецЦикла;
		
		Параметры.Отбор.Вставить("Владелец", МассивОтбора);
		
		// Признак повторного входа.
		Параметры.Вставить("Рекурсия");
		
		// Получим стандартный список выбора с учетом дополненного отбора.
		СтандартныйСписок = ПолучитьДанныеВыбора(Параметры);
		
		Если НЕ (Параметры.Свойство("НеИспользоватьКлассификатор") И Параметры.НеИспользоватьКлассификатор = Истина) Тогда
			Если ЗначениеЗаполнено(Номенклатура) Тогда
			// Дополним стандартный список базовой единицей измерения номенклатуры по классификатору.
				ПредставлениеЕдиницыИзмерения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 (ед. хранения)'"),
					ЕдиницаИзмеренияВладельцаПредставление);
					
				ПредставлениеЕдиницыХранения = Новый ФорматированнаяСтрока(ПредставлениеЕдиницыИзмерения, Новый Шрифт(,,Истина));
				СтандартныйСписок.Вставить(0, ЕдиницаИзмеренияВладельца, ПредставлениеЕдиницыХранения);
			КонецЕсли;
		КонецЕсли;
		
		ДанныеВыбора = СтандартныйСписок;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ТипЗнч(Данные) = Тип("Структура") И Данные.Свойство("Ссылка") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Ссылка = Данные.Ссылка; 
		
		ТекстШаблона = НСтр("ru = '%1 (%2 %3)'");
		
		Если ЗначениеЗаполнено(Ссылка.ЕдиницаИзмеренияПоКлассификатору) Тогда
			
			ПредставлениеЕдиницыИзмерения = СокрЛП(Ссылка.ЕдиницаИзмеренияПоКлассификатору);
			
		ИначеЕсли НЕ ПустаяСтрока(Ссылка.Наименование) Тогда
			
			ПредставлениеЕдиницыИзмерения = СокрЛП(Ссылка.Наименование);
			
		Иначе
			
			ПредставлениеЕдиницыИзмерения = НСтр("ru = '<ед.изм.>'");
			
		КонецЕсли;
		
		Если Ссылка.Коэффициент >= 1 Тогда
			
			Представление = СтрШаблон(ТекстШаблона, Ссылка.Наименование, Ссылка.Коэффициент, СокрЛП(Ссылка.ЕдиницаИзмеренияВладельца));
			
		ИначеЕсли Не Ссылка.Коэффициент = 0 Тогда
			
			Представление = СтрШаблон(ТекстШаблона, Ссылка.Наименование, ОКР(1/Ссылка.Коэффициент, 3), ПредставлениеЕдиницыИзмерения);
		Иначе
			
			СтандартнаяОбработка = Истина;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
